"""
پلتفرم لایسنس و فروش ربات.

این پکیج کاملاً از خود ربات تیم‌تاک جداست: ربات فقط یه فایل لایسنس کنار
خودش می‌خونه (core/license_gate.py) و هیچ‌وقت به دیتابیس یا تلگرام کاری
نداره. یعنی می‌شه پلتفرم رو روی یه سرور دیگه اجرا کرد، یا حتی موقتاً
خاموشش کرد، بدون این‌که ربات‌های در حال اجرا بیفتن.

نقشه‌ی فایل‌ها:
    catalog.py       پلن‌ها، امکانات، قیمت دلاری (قابل override با JSON)
    config.py        توکن‌ها، ادمین‌ها، شماره کارت، مسیرها
    db.py            اسکیمای SQLite و کوئری‌ها
    pricing.py       تبدیل دلار به تومان (API + مقدار دستی)
    receipts.py      بررسی عکس رسید با OCR محلی + قواعد
    licenses.py      ساخت/تمدید/انقضا/امکانات لایسنس
    keys.py          جفت‌کلید Ed25519 (لایسنس اجاره‌ای روی Cloudflare Worker)
    provisioning.py  ساخت و حذف واقعی نمونه‌ی ربات (لاین صدا، دیتا، پروسه)
    supervisor.py    اجرا و نگه‌داشتن پروسه‌های ربات
    expiry.py        چک انقضا (شبانه + لحظه‌ای)
    telegram/        ربات فروش، پنل ادمین، ربات شخصی مشتری‌ها
"""
